# Laboratorio de Introducción a Pandas

Completa el siguiente conjunto de ejercicios para consolidar tu conocimiento de los fundamentos de Pandas.

### 1. Importa Numpy y Pandas y asígnalos los alias `np` y `pd` respectivamente.

In [2]:
import pandas as pd
import numpy as np

### 2. Crea una Serie de Pandas que contenga los elementos de la lista a continuación.

In [4]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [12]:
lista_serie = pd.Series(lst)
print(lista_serie)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Usa la indexación para devolver el tercer valor en la Serie anterior.

*Sugerencia: Recuerda que la indexación comienza en 0.*

In [14]:
lista_serie[2]

74.4

### 4. Crea un DataFrame de Pandas a partir de la lista de listas a continuación. Cada sublista debe representarse como una fila.

In [16]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [18]:
df_b = pd.DataFrame(b)
df_b.head()

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9

### 5. Renombra las columnas del DataFrame basándote en los nombres de la lista a continuación.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [20]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']
df_b = pd.DataFrame(b)
df_b.columns = colnames
df_b.head()

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9

### 6. Crea un subconjunto de este DataFrame que contenga solo las columnas de Puntuación 1, 3 y 5.

In [24]:
subset_6 = df_b[['Score_1', 'Score_3', 'Score_5']]
subset_6.head()

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9

### 7. Del DataFrame original, calcula el valor promedio de Score_3.

In [26]:
serie_3 = pd.Series(df_b['Score_3'])
mean_7 = serie_3.mean()
print(mean_7)

56.95000000000001

In [28]:
# There is also another method in DataFrame to do the mean
mean_7 = df_b['Score_3'].mean()
print(mean_7)

56.95000000000001

### 8. Del DataFrame original, calcula el máximo valor del Score_4.

In [30]:
max_8 = df_b['Score_4'].max()
print(max_8)

88.8

### 9. Del DataFrame original, calcula la media valor del Score_2.

In [34]:
median_9 = df_b['Score_2'].median()
print(median_9)

40.75

### 10. Crea un DataFrame de Pandas a partir del diccionario de pedidos de productos a continuación.

In [36]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [46]:
df_orders = pd.DataFrame(orders)
df_orders.head()

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50

### 11. Calcula la cantidad total pedida y los ingresos generados a partir de estos pedidos.

In [66]:
total_quantity = df_orders['Quantity'].sum()
total_revenue = df_orders['Revenue'].sum()

print(f"Total quantity is {total_quantity}, and total revenue is {total_revenue}")

Total quantity is 2978, and total revenue is 637.0

### 12. Obten los precios del artículo más caro y del más barato pedidos e imprime la diferencia.

In [74]:
most_expensive_price = df_orders['UnitPrice'].max()
cheapest_price = df_orders['UnitPrice'].min()

# Now I want to know which item had the max and min prices.
# For that, we filter in our df by the max and min prices, so we end up just with the rows that matches that value in Description column
# Given that df_orders[df_orders['UnitPrice'] == most_expensive_price]['Description'] is a series (like a list of values), 
    # we want the first or unique value, We use .values[0]
    # to get the first value of the serie
most_expensive_item = df_orders[df_orders['UnitPrice'] == most_expensive_price]['Description'].values[0]
cheapest_item = df_orders[df_orders['UnitPrice'] == cheapest_price]['Description'].values[0]

difference = most_expensive_price - cheapest_price

print(f"Most expensive product: {most_expensive_item} - Price: {most_expensive_price}")
print(f"Cheapest product: {cheapest_item} - Price: {cheapest_price}")
print(f"The difference between these two prices is {difference}")

Most expensive product: BOX OF VINTAGE ALPHABET BLOCKS - Price: 11.95
Cheapest product: WORLD WAR 2 GLIDERS ASSTD DESIGNS - Price: 0.18
The difference between these two prices is 11.77

## Carguemos otro conjunto de datos para más ejercicios

In [78]:
# Tu código aquí
admissions = pd.read_csv('../Admission_Predict.csv')

Evaluemos el conjunto de datos mirando la función `head`.

In [80]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Antes de comenzar a trabajar con este conjunto de datos y evaluar los datos de admisiones de posgrado, verificaremos que no haya datos faltantes en el conjunto de datos. Haz esto en la celda de abajo.

In [94]:
admissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

In [90]:
missing_values = admissions.isnull()
missing_count = missing_values.sum()

missing_count

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Curiosamente, hay una columna que identifica de manera única a los solicitantes. Esta columna es la columna de número de serie. En lugar de tener nuestro propio índice, deberíamos hacer de esta columna nuestro índice. Haz esto en la celda de abajo. Mantén la columna en el marco de datos además de hacerla un índice.

In [189]:
admissions = admissions.set_index('Serial No.', drop=False)
admissions.head(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90
6,6,321,109,3,3.0,4.0,8.20,1,0.75
7,7,308,101,2,3.0,4.0,7.90,0,0.68
8,8,302,102,1,2.0,1.5,8.00,0,0.50
9,9,323,108,3,3.5,3.0,8.60,0,0.45
10,10,327,111,4,4.0,4.5,9.00,1,0.84

Resulta que `GRE Score` y `CGPA` también identifican de manera única los datos. Muestra esto en la celda de abajo.

In [167]:
unique_GRE = admissions['GRE Score'].unique()
count_GRE = len(unique_GRE)
unique_CGPA = admissions['CGPA'].unique()
count_CGPA = len(unique_CGPA)

shape = admissions.shape

print(f"""
        It seems that GRE and CGPA are not unique indentifiers since the lenght of admissions is not the same as the number of uniques values
        of GRE : {count_GRE} and CCGPA: {count_CGPA}. Look, at the shape of the df {shape}. Therefore we know that
        these values are not unique to each student. There should be no repetitions, therefore they wouldn't work as unique ids 
        """)

        It seems that GRE and CGPA are not unique indentifiers since the lenght of admissions is not the same as the number of uniques values
        of GRE : 49 and CCGPA: 168. Look, at the shape of the df (385, 9). Therefore we know that
        these values are not unique to each student. There should be no repetitions, therefore they wouldn't work as unique ids


### 3 - En esta parte del laboratorio, nos gustaría probar condiciones complejas en todo el conjunto de datos de una vez. Comencemos encontrando el número de filas donde el CGPA es mayor a 9 y el estudiante ha realizado una investigación.

In [185]:
admissions_filtered = admissions[(admissions['CGPA'] > 9) & (admissions['Research'] == 1)]
number_rows = len(admissions_filtered)
print(f"There are {number_rows} where CGPA is greater than 9 and the student has also done a research")

There are 101 where CGPA is greater than 9 and the student has also done a research

### 4 - Ahora devuelve todas las filas donde el CGPA es mayor a 9 y la puntuación SOP es menor a 3.5. Encuentra la probabilidad media de admisión para estos solicitantes.

In [199]:
admissions_filtered_4 = admissions[(admissions['CGPA'] > 9) & (admissions['SOP'] < 3.5)]

mean_chance_admit = admissions_filtered_4['Chance of Admit '].mean()

print(f"The mean chance of admit is {mean_chance_admit:.3f}")

The mean chance of admit is 0.802